const deta = [
    [
        "τ.λιυ,本町四丁目発(バス)",
        new Date("2022/09/30 10:04")
    ],
    [
        "τ.λιυ,広島駅着",
        new Date("2022/09/30 10:19")
    ],
    [
        "Kendea&τ.λιυ,広島駅発(バス)",
        new Date("2022/09/30 10:29")
    ],
    [
        "Kendea&τ.λιυ,本町四丁目着",
        new Date("2022/09/30 10:42")
    ],
    [
        "Kendea&τ.λιυ,τ.λιυ宅発",
        new Date("2022/09/30 12:30")
    ],
    [
        "Kendea&τ.λιυ,ソレイユ着,昼食",
        new Date("2022/09/30 12:50")
    ],
    [
        "Kendea&τ.λιυ,τ.λιυ宅着",
        new Date("2022/09/30 14:00")
    ],
    [
        "Kendea&τ.λιυ,本町四丁目発(バス)",
        new Date("2022/09/30 16:07")
    ],
    [
        "Kendea&τ.λιυ,広島駅着",
        new Date("2022/09/30 16:22")
    ]
];